{
  "sections": {
    "main": {
      "type": "main-page",
      "custom_css": [
        "h1.page-title.cc-animate-init.-in.cc-animate-complete {display: none;}"
      ],
      "settings": {
      }
    },
    "e9c44e1d-53d1-45e4-93fb-31b0731ca574": {
      "type": "image-with-text",
      "disabled": true,
      "settings": {
        "subheading": "",
        "title": "Meet Dr. Corrie",
        "text": "<p>Hello! I'm Dr. Corrie Amos, a board-certified anesthesiologist, culinary enthusiast, and health & wellness advocate. <strong>The Spice Theory<\/strong> is the brainchild of my forged love of good food and my passion for science! Let me tell you a little bit about me!<\/p><p>I am a child of immigrants so I spent my childhood between NYC where I was born and Jamaica, where I am from. I spent my formative years in Jamaica and it was there that I discovered a love of science and medicine. I like to break things down to their elements...see how they are made. <strong>I was inquisitive about everything! Especially food.<\/strong> I was my grandmother’s shadow in the kitchen watching fascinated as she gathered her herbs and spices to “season” the food.<\/p><p>“Mama what is this? Mama why do you put that on the chicken? Mama will this make the food taste better? These were the questions I would pepper my grandmother with. My mama’s house was where you went to get an authentic Jamaican meal that would rival any 5-star restaurant...the secret? The <strong>herbs and spices, always fresh<\/strong> from the Market. Cooking was our shared love language, and we bonded as we created spice mixes together. As I blossomed into my own cook, my fascination with healthy cooking was further driven by years of medical training and my scientific curiosity. It is an accepted fact that chronic health conditions are ravaging our community. Poor diet and poor food preparation techniques are a driving factor in these unhealthy outcomes. The available commercial spices heavily filled with preservatives and MSG didn’t make it any better.<\/p><p><\/p>",
        "button_label": "",
        "button_link": "",
        "button_style": "primary",
        "text_alignment": "left",
        "text_width": 68,
        "image": "shopify:\/\/shop_images\/Screen_Shot_2023-09-17_at_10.51.16_PM.png",
        "video": " https:\/\/youtu.be\/yNXAo0lkVjk",
        "image_width": 96,
        "image_position": "left",
        "media_size": "contain",
        "alternate_bg_color": false
      }
    },
    "32ecc502-9574-4073-8746-1cddfe24524b": {
      "type": "rich-text",
      "disabled": true,
      "settings": {
        "subheading": "",
        "title": "",
        "title_size": 16,
        "heading_h1": false,
        "text": "<p>My research took me to Nairobi, Kenya where I studied medicinal plants and herbs. This opened the world of herbal medicine to me, and I began experimenting with <strong>crafting spice mixes<\/strong> and honing in on their medicinal value. I understood the need for robust spices that weren't heavily burdened by artificial additives. Now, I approach blending spices with an innovative and intellectual curiosity often <strong>building complex flavor profiles,<\/strong> and breaking them back down to harness the therapeutic benefits of each spice. I am thankful that medicine has exposed me to the cuisine of many great cities: Asheville, New Orleans, Marrakesh and Nairobi to name a few. It has also allowed me to approach cooking from a more health conscious standpoint without compromising flavor.<\/p><p>I'm now back in New York where it all began! Whether I'm hosting a dinner party for friends or making a scrumptious meal for my husband and family, the creativity in the kitchen never ceases. <strong>The Spice Theory<\/strong> was born of that desire to be inquisitive. Food should be bold not boring. Push the boundaries and dare to be different! I hope to continue my grandmother’s traditions of inspiring people through food, and sharing my knowledge of what's good for your body and soul.<\/p><p>Let great food be your medicine!<\/p><p><\/p><p><\/p><p><\/p><p><\/p>",
        "enlarge_text": false,
        "button_label": "",
        "button_link": "",
        "button_style": "primary",
        "text_alignment": "left",
        "full_width": true,
        "no_padding": true,
        "color_bg": "",
        "alternate_bg_color": false
      }
    },
    "a4ae71a4-a260-4893-b5b6-f00d2bcf7707": {
      "type": "image-with-text",
      "disabled": true,
      "settings": {
        "subheading": "",
        "title": "DARE TO BE DIFFERENT WITH THE SPICE THEORY",
        "text": "<p>'Welcome to Jamrock' Jerk Spice Rub provides the perfect balance of tropical flavors with the right amount of heat! Try Dr. Corrie's top selling spice blend on your jerk chicken and much more! Check out this jerk chicken recipe for a tantalizing sizzle your taste buds won't forget!<\/p>",
        "button_label": "Shop Now",
        "button_link": "",
        "button_style": "primary",
        "text_alignment": "left",
        "text_width": 60,
        "video": "",
        "image_width": 100,
        "image_position": "left",
        "media_size": "contain",
        "alternate_bg_color": false
      }
    }
  },
  "order": [
    "main",
    "e9c44e1d-53d1-45e4-93fb-31b0731ca574",
    "32ecc502-9574-4073-8746-1cddfe24524b",
    "a4ae71a4-a260-4893-b5b6-f00d2bcf7707"
  ]
}
